Autodesk.Revit.DB.LineProperties.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.LineProperties.PatternId
Id of the current Line pattern element used when drawing lines/curves.
Since:
2016

Autodesk.Revit.DB.LineProperties.LineWidth
The current width (thickness) of the pen stroke when drawing lines/curves.
Since:
2016

Autodesk.Revit.DB.LineProperties.Transparency
The current transparency level to be applied to the current color.
Since:
2016

Autodesk.Revit.DB.LineProperties.Color
The current color used when drawing lines/curves.
Since:
2016

Autodesk.Revit.DB.LineProperties
A structure that has access to the pen properties of lines/curves
that are currently being drawn/exported via an export context
during a custom export process.
Remarks:
For more about using properties of this class refer to the interface
Autodesk::Revit::DB::IModelExportContext and its methods
which handle geometric objects such as Autodesk::Revit::DB::IModelExportContext::OnCurve,
Autodesk::Revit::DB::IModelExportContext::OnLineSegment, etc.
LineProperties are available as a read-only property on the respective output nodes,
i.e. Autodesk::Revit::DB::CurveNode, Autodesk::Revit::DB::LineSegment, etc.
Since:
2016